//#include <8051.h>
//// При каждом нажатии кнопки значение на семисегментном
//// индикаторе уменьшается на 2, начиная с 9
//int counter;
//int i, j;
//unsigned char button = 1;
//unsigned char __at(0x90) button;
//void main()
//{
//    
//    P35 = 0x01;
//    P2 = 0x00;
//  
//    while (1) {
//        if (button == 0) { // Если кнопка нажата P35 = 0
//        
//        }
//        else {
//
//        }
//    }
//   
//    for (i = 0;; i++)
//    {
//        P2 = counter;
//        counter++;
//        for (j = 0; j < 100; j++);
//    }
//    
//
//}




#include <8051.h>
// по дефолту семисигментник сам шагает с 1 до F
// при нажатии на кнопку идет переключение режима на тот, что в варианте
// т.е. при нажатии кнопки идет само переключение 9 7 5 3 1 9 7 5 3 1
// при нажатии еще раз, переключает вновь на обынчый счет с 1 до F 

// Итерации семисигментника при обычном режиме работы счета
// 0 --> 1111110 --> 7E
// 1 --> 0110000 --> 30
// 2 --> 1101101 --> 6D
// 3 --> 1111001 --> 79
// 4 --> 0110011 --> 33
// 5 --> 1011011 --> 5B
// 6 --> 1011111 --> 5F
// 7 --> 1110000 --> 70
// 8 --> 1111111 --> 7F
// 9 --> 1111011 --> 7B
// 10(A) --> 1110111 --> 77
// 11(B) --> 0011111 --> 1F
// 12(C) --> 1001110 --> 4E
// 13(D) --> 0111101 --> 3D
// 14(E) --> 1001111 --> 4F
// 15(F) --> 1000111 --> 47

const unsigned char arr0[] = {
	0x7E,
	0x30,
	0x6D,
	0x79,
	0x33,
	0x5B,
	0x5F,
	0x70,
	0x7F,
	0x7B,
	0x77,
	0x1F,
	0x4E,
	0x3D,
	0x4F,
	0x47
};

int counter, i;
const unsigned char arr[] = {
	// Режим работы семисигментника при переключения режима на режим по варианту
	0x7B, // 9 -> 1111011 -> 7B
	0x70, // 7 -> 1110000 -> 70
	0x5B, // 5 -> 1011011 -> 5B
	0x79, // 3 -> 1111001 -> 79
	0x30  // 1 -> 0110000 -> 30
};
void main() {
P35 = 0;
P2 = 0x00;
counter = 0;
	while (1) {
		if (P35 == 1) {
			if (counter > 4) {
				counter = 0;
			}	
			P2 = arr[counter];
			
			
			P37 = 1;
			P37 = 0;
			counter++;
			for (i = 0; i < 1; i++); // задержка (в развитии)
		}
		else {
			if (counter > 15) {
				counter = 0;
			}
			P2 = arr0[counter];
			P37 = 1;
			P37 = 0;
			counter++;
			for (i = 0; i < 1; i++);
		}
	}
}